1s/ERP/Conf/InformationRegisters/Лико_ВыпускГППоБланку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ВыпускГППоБланку</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоВРолике</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоРучьев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗакрытиеБланка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_БланкЭтапа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтатусыВыпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтатусыВыпуска</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перемотка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ВыпускГППоБланку/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура Записать(Регистратор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РегистраторОбъект = ?(ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Регистратор)),Регистратор.ПолучитьОбъект(),Регистратор);
	
	

	ЗаписатьПоЗакрытиюБланка(РегистраторОбъект);
		
	
КонецПроцедуры 




#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Процедура ЗаписатьПоЗакрытиюБланка(РегистраторОбъект)
	

	
	Если ТипЗнч(РегистраторОбъект)<> Тип("ДокументОбъект.Лико_БланкЭтапа")   Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	Если РегистраторОбъект.СтатусВыпуска<>Перечисления.Лико_СтатусыВыпуска.Перемотка Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	  //РегистраторОбъект = Документы.Лико_БланкЭтапа.СоздатьДокумент();
	
	
	//Товары  	= РегистраторОбъект.Товары.НайтиСтроки(Новый Структура("Списать", Истина));
	//Выпуски 	= РегистраторОбъект.Выпуск.Выгрузить();
	//
	//РС =РегистрыСведений.Лико_ВыпускГППоБланку.СоздатьНаборЗаписей();
	//ТЗ = РС.Выгрузить(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_БланкЭтапаТовары.Серия КАК Серия,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	Лико_БланкЭтапаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ЗакрытиеБланка КАК ЗакрытиеБланка,
	|	Лико_БланкЭтапаТовары.Ссылка.ЗаказПокупателя КАК ЗаказКлиента,
	|	Лико_БланкЭтапаТовары.КоличествоШт КАК КоличествоВРолике,
	|	Лико_БланкЭтапаТовары.КоличествоРучьев КАК КоличествоРучьев,
	|	Лико_БланкЭтапаТовары.КоличествоШт * Лико_БланкЭтапаТовары.КоличествоРучьев КАК Количество,
	|	Лико_БланкЭтапаТовары.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",РегистраторОбъект.Ссылка );
	ТЗ = Запрос.Выполнить().Выгрузить();
	                      
	
	
	//ТЗ = Новый ТаблицаЗначений;
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("СтатусВыпуска"     ,Новый ОписаниеТипов("ПеречислениеСсылка.Лико_СтатусыВыпуска"));
	//ТЗ.Колонки.Добавить("Печатник"          ,Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	//ТЗ.Колонки.Добавить("Перемотчик"        ,Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	//ТЗ.Колонки.Добавить("Упаковщик"         ,Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	//ТЗ.Колонки.Добавить("НомерБланка",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	//ТЗ.Колонки.Добавить("ОбъектНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ЯССМ_ОбъектыНоменклатуры"));
	
	
	
	
	//Для каждого Товар  Из Товары Цикл
	//	
	//	Для каждого Выпуски Из Выпуски Цикл 
	//		
	//		
	//		
	//		
	//	
	//		
	//	
	//	КонецЦикла;
	//	
	//КонецЦикла;

	
	  	
	СформироватьНаборЗаписей(РегистраторОбъект,ТЗ);
	
КонецПроцедуры 



Процедура СформироватьНаборЗаписей(РегистраторОбъект,ТЗ)
	
	Если ТЗ.Количество()=0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	
	

	

	
	НаборЗаписей = РегистрыСведений.Лико_ВыпускГППоБланку.СоздатьНаборЗаписей();

	
	Для каждого СтрокаТЗ Из ТЗ Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(РегистраторОбъект.Ссылка);
		//НаборЗаписей.Отбор.Серия.Установить(Серия); 
		//НаборЗаписей.Отбор.Период.Установить(РегистраторОбъект.Дата); 
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Регистратор = РегистраторОбъект.Ссылка;
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЗ);
		
					
	КонецЦикла;
   НаборЗаписей.Записать();

КонецПроцедуры 



#КонецОбласти

#КонецЕсли
